## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault.bleu will be created
  + resource "azurerm_key_vault" "bleu" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Delete",
                ]
              + object_id          = "861010ac-21ae-4da1-a0f8-34326adcfc02"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                ]
              + tenant_id          = "4e4151dc-0232-4e6b-9f24-5c0ecf5abc33"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-bleu-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + tenant_id                     = "4e4151dc-0232-4e6b-9f24-5c0ecf5abc33"
      + vault_uri                     = (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "postgresql-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_kubernetes_cluster.bleu will be created
  + resource "azurerm_kubernetes_cluster" "bleu" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "bleu-dev"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.28.3"
      + location                            = "eastus"
      + name                                = "aks-bleu-dev"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-bleu-dev"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + tags                                = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "Bleu"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.Network/virtualNetworks/vnet-bleu-dev/subnets/snet-aks-dev"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip     = "10.2.0.10"
          + docker_bridge_cidr = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.2.0.0/16"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_postgresql_flexible_server.bleu must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "bleu" {
      ~ fqdn                          = "psql-bleu-dev.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-bleu-dev" -> (known after apply)
      ~ name                          = "psql-bleu-dev" -> (known after apply) # forces replacement
      + private_dns_zone_id           = (known after apply)
      ~ public_network_access_enabled = true -> (known after apply)
        tags                          = {
            "Environment" = "Development"
            "ManagedBy"   = "Terraform"
            "Project"     = "Bleu"
        }
        # (13 unchanged attributes hidden)

      ~ authentication (known after apply)
      - authentication {
          - active_directory_auth_enabled = false -> null
          - password_auth_enabled         = true -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_postgresql_flexible_server_database.bleu must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "bleu" {
      ~ id        = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-bleu-dev/databases/bleu_db" -> (known after apply)
        name      = "bleu_db"
      ~ server_id = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-bleu-dev" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_postgresql_flexible_server_firewall_rule.allow_azure_services must be replaced
-/+ resource "azurerm_postgresql_flexible_server_firewall_rule" "allow_azure_services" {
      ~ id               = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-bleu-dev/firewallRules/AllowAzureServices" -> (known after apply)
        name             = "AllowAzureServices"
      ~ server_id        = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/psql-bleu-dev" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8557fe6a-e6ba-4ade-906e-d36316cbf71c/resourceGroups/rg-bleu-dev/providers/Microsoft.ContainerRegistry/registries/acrbleudev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # random_string.resource_suffix will be created
  + resource "random_string" "resource_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 8 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + aks_kube_config                 = (sensitive value)
  + connection_commands             = (known after apply)
  ~ key_vault_name                  = "kv-bleu-dev" -> (known after apply)
  ~ postgresql_server_fqdn          = "psql-bleu-dev.postgres.database.azure.com" -> (known after apply)
```
</details>